namespace Hidistro.Messages
{
    using System;

    public enum IndustryCode
    {
        IT科技_IT软件与服务 = 2,
        IT科技_IT硬件与设备 = 3,
        IT科技_电子技术 = 4,
        IT科技_互联网_电子商务 = 1,
        IT科技_通信与运营商 = 5,
        IT科技_网络游戏 = 6,
        餐饮_餐饮 = 10,
        房地产_建筑 = 0x1d,
        房地产_物业 = 30,
        交通工具_飞机相关 = 0x1c,
        交通工具_火车相关 = 0x1b,
        交通工具_摩托车相关 = 0x1a,
        交通工具_汽车相关 = 0x19,
        教育_培训 = 0x10,
        教育_院校 = 0x11,
        金融业_保险 = 9,
        金融业_基金_理财_信托 = 8,
        金融业_银行 = 7,
        酒店旅游_酒店 = 11,
        酒店旅游_旅游 = 12,
        其它_其它 = 0x29,
        请求成功 = 0x2a,
        商业服务_法律 = 0x20,
        商业服务_会展 = 0x21,
        商业服务_认证 = 0x23,
        商业服务_审计 = 0x24,
        商业服务_中介服务 = 0x22,
        文体娱乐_传媒 = 0x25,
        文体娱乐_体育 = 0x26,
        文体娱乐_娱乐休闲 = 0x27,
        消费品_消费品 = 0x1f,
        医药护理_保健与卫生 = 0x18,
        医药护理_护理美容 = 0x17,
        医药护理_医药医疗 = 0x16,
        印刷_印刷 = 40,
        运输与仓储_仓储 = 15,
        运输与仓储_快递 = 13,
        运输与仓储_物流 = 14,
        政府与公共事业_博物馆 = 20,
        政府与公共事业_公共事业_非盈利机构 = 0x15,
        政府与公共事业_交警 = 0x13,
        政府与公共事业_学术科研 = 0x12
    }
}

